cases/Brownian/0.org/VG.continuous
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      VG.continuous;
}

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    inlet
    {
        type        fixedValue;
        value       $internalField;
    }

    outlet
    {
        type        fixedValue;
        value       uniform 0.0;
    }

    walls
    {
        type        zeroGradient;
    }

    empties
    {
        type        empty;
    }
}
